app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    @users = RedisModule::Getters.new.get_key_value("users")
    if(@users.nil?)
      @users = User.all.to_json
      RedisModule::Setters.new.set_key_value("users", @users)
    end
    @users = JSON.load(@users)