app/controllers/versions_controller.rb

SELECT `versions`.* FROM `versions` LIMIT 50
---
  def index
    @versions = Version.limit(50)

INSERT INTO `versions` (`item_type`, `created_at`, `updated_at`) VALUES ('ada', '2019-08-24 12:50:31.518109', '2019-08-24 12:50:31.518109')
---
  def create
    @version = Version.new(version_params)

    respond_to do |format|
      if @version.save